buzzwang1/pcb/source/main/STM32L433CCT/Mot/Test03/MotCtrl.h
#ifndef __MOTOR_CONTROL_H__
#define __MOTOR_CONTROL_H__


#include "TypeDef.h"
#include "stm32l433xx.h"
#include "stm32l4xx_hal.h"
#include "stm32l4xx_ll_adc.h"

#include "math.h"
#include "cFixPti1814.h"

#include "tGPPin.h"
#include "LED.h"

#include "math_tool.h"
#include "ClockInfo.h"

#include "control_table.h"
#include "math_tool.h"
#include "binary_tool.h"

// CONTROL LOOP
#define LOOP_FREQUENCY_HZ 1000.0f //Hz

// MOTOR
#define MOTOR_PWM_BRAKE 99
#define MOTOR_PWM_COAST 0

// POSITION FILTER
#define ALPHA_POSITION        0.05f // (default:0.05) F = 20kHz ==> Fc (-3dB) = 170.0Hz
#define ALPHA_VOLTAGE        0.05f // (default:0.05) F = 20kHz ==> Fc (-3dB) = 170.0Hz
#define ALPHA_CURRENT_SENSE      0.05f // (default:0.05) F = 20kHz ==> Fc (-3dB) = 170.0Hz
#define ALPHA_CURRENT_SENSE_OFFSET   0.001f


#define ALPHA_VELOCITY      0.12f // (default:0.12) F = 1000Hz ==> Fc (-3dB) = 20Hz
#define ALPHA_CURRENT_SETPOINT   0.96f // (default:0.12) F = 1000Hz ==> Fc (-3dB) = 20Hz
#define ALPHA_PWM_SETPOINT    0.12f // (default:0.12) F = 1000Hz ==> Fc (-3dB) = 20.0Hz
#define VOLTAGE_CALIBRATION   1.08f


class cfLowPass
{
  public:
  float mValue;
  float mFactor;

  cfLowPass(float lfFactor)
  {
    mFactor = lfFactor;
    mValue  = 0;
  }

  float DoProcess(float lfNewValue)
  {
    mValue = ((mFactor * lfNewValue) + ((1.0f - mFactor) * mValue));
    return mValue;
  }
};


class cfPid
{
  public:
  float err_last_one;
  float err_integral;
  float derivative_filtered;

  cfLowPass mLpDerivative;
  cfLowPass mLpOutput;

  cfPid()
    : mLpDerivative(ALPHA_VELOCITY),
      mLpOutput(ALPHA_VELOCITY)
  {
    pid_reset();
  }

  void pid_reset()
  {
    err_last_one = 0.0f;
    err_integral = 0.0f;
    derivative_filtered = 0.0f;
  }

  float pid_process_antiwindup_clamp(
      float error,
      float kp,
      float ki,
      float kd,
      float output_limit
  )
  {
    // filter derivative
    derivative_filtered = mLpDerivative.DoProcess(error - err_last_one);
    // update derivative state
    err_last_one = error;

    // PID
    float const p_term = kp*error;
    float const i_term = err_integral;
    float const d_term = kd*derivative_filtered;
    // compute output before saturation
    float const v = p_term + i_term + d_term;
    // saturation
    float const u = cMathTool::fconstrain(v,-output_limit,output_limit);
    // output saturating
    bool saturating = (u!=v);
    // error and output same sign
    bool sign = (error*v >= 0);
    // zero
    bool clamp = saturating && sign;
    if(!clamp)
      err_integral = err_integral + ki*error;
    // output
    return mLpOutput.DoProcess(u);
  }
};


class cFpLowPass
{
  public:
  cFixPti1814 mValue;
  cFixPti1814 mFactor;

  cFpLowPass(i32 li32Factor)
  {
    mFactor.vSetFrac(li32Factor);
    mValue.vSet(0);
  }

  cFixPti1814 DoProcess(cFixPti1814 lFpNewValue) // __attribute__((optimize("-O0")))
  {
    mValue = mFactor * lFpNewValue + (cFixPti1814(1) - mFactor) * mValue;
    return mValue;
  }
};


class cFpPid
{
  public:
  cFixPti1814 Fperr;
  cFixPti1814 Fperr_last_one;

  cFixPti1814 Fperr_integral;
  cFixPti1814 Fpderivative_filtered;

  cFpLowPass mLpDerivative;
  cFpLowPass mLpOutput;

  cFpPid()
    : mLpDerivative((i16)(ALPHA_VELOCITY*16384.0f)),
      mLpOutput((i16)(ALPHA_VELOCITY*16384.0f))
  {
    pid_reset();
  }

  void pid_reset()
  {
  }

  float pid_process_antiwindup_clamp(
      float error,
      float kp,
      float ki,
      float kd,
      i32   output_limit
  ) // __attribute__((optimize("-O0")))
  {
    Fperr.vSetFrac((i32)(error * 16384.0f));

    // filter derivative37174
    Fpderivative_filtered = mLpDerivative.DoProcess(Fperr - Fperr_last_one);

    // update derivative state
    Fperr_last_one = Fperr;

    // PID
    cFixPti1814 p_term;    p_term.vSetFrac((i32)(kp * 16384.0f)); p_term *= Fperr;
    cFixPti1814 i_term;    i_term = Fperr_integral;
    cFixPti1814 d_term;    d_term.vSetFrac((i32)(kd * 16384.0f)); d_term *= Fpderivative_filtered;

    cFixPti1814 v = p_term + i_term + d_term;

    // saturation
    cFixPti1814 u;
    u = v;

    if (u.i32Get() >= output_limit)       u = cFixPti1814(output_limit);
    else if (u.i32Get() <= -output_limit) u = cFixPti1814(-output_limit);

    // output saturating
    bool saturating = (u.mFp.i32Fp !=v.mFp.i32Fp);
    // error and output same sign
    bool sign = (Fperr.i8Sign() *v.i8Sign() > 0);
    // zero
    bool clamp = saturating && sign;
    if(!clamp)
    {
      cFixPti1814 lFpZwerg;    lFpZwerg.vSetFrac((i32)(ki * 16384.0f));
      Fperr_integral += (lFpZwerg * Fperr);
    }

    // output
    return mLpOutput.DoProcess(u).i32Get();
  }
};


class cAdcControl
{
public:
  // https://github.com/STMicroelectronics/STM32CubeL4/tree/master/Projects/NUCLEO-L476RG/Examples_LL/ADC/ADC_SingleConversion_TriggerSW/Src
  // ADC
  typedef enum
  {
    // Events für allgemeine Verwenung
    nEvReset = 0,
    nEvStart,
    nEvStop,

    nEvDummy
  }MAIN_tenEvents;

  typedef enum
  {
    nSmIdle = 0,

    // States für ADC
    nSmAdcRun,

    nSmDummy
  }MAIN_tenStates;


  typedef enum
  {
    nChnPoti = LL_ADC_CHANNEL_6,

    nAdcResolution10 = 1024, //1 << 10, // 10 Bit
    nAdcResolution12 = 4096, //1 << 12, // 12 Bit
    nAdcResolution16 = 65536, //1 << 16, // 16 Bit
    nAdcResolution   = nAdcResolution12,
    nAdcRefmV        = 3300,

    nAdcMeasureCnt   = 6,
    nAdcMeasureAvg   = 8,

    MAIN_nVDummy
  }MAIN_tenConsts;


  MAIN_tenStates menSmMain_Adc = nSmIdle;

  cAdcControl()
  {
    vInitAdc();
  }

  void vInitAdc()
  {
    cGpPin lcAIn1(GPIOA_BASE, 1, GPIO_MODE_ANALOG, GPIO_NOPULL, GPIO_SPEED_FREQ_LOW, 0); // ADC1_IN6

    vDeInitAdc();

    //enable ADC1 clock
    __HAL_RCC_ADC_CLK_ENABLE();

    /* PCLK2 is the APB2 clock */
    /* ADCCLK = PCLK2/4 = 16/4 = 4MHz*/
    LL_ADC_CommonInitTypeDef ADC_CommonInit;
    LL_ADC_CommonStructInit(&ADC_CommonInit);
    ADC_CommonInit.CommonClock = LL_ADC_CLOCK_SYNC_PCLK_DIV4;
    LL_ADC_CommonInit(__LL_ADC_COMMON_INSTANCE(ADC1), &ADC_CommonInit);

    //ADC1 configuration
    LL_ADC_InitTypeDef ADC_Init;
    LL_ADC_StructInit(&ADC_Init);
    ADC_Init.Resolution    = LL_ADC_RESOLUTION_12B;
    ADC_Init.DataAlignment = LL_ADC_DATA_ALIGN_RIGHT;
    ADC_Init.LowPowerMode  = LL_ADC_LP_MODE_NONE;
    LL_ADC_Init(ADC1, &ADC_Init);

