buzzwang1/pcb/source/main/STM32L433CCT/Mot/Test03/MotCtrl.h
    LL_ADC_REG_InitTypeDef ADC_RegInit;
    LL_ADC_REG_StructInit(&ADC_RegInit);
    ADC_RegInit.TriggerSource    = LL_ADC_REG_TRIG_SOFTWARE;
    ADC_RegInit.SequencerDiscont = LL_ADC_REG_SEQ_DISCONT_DISABLE;
    ADC_RegInit.ContinuousMode   = LL_ADC_REG_CONV_CONTINUOUS;
    ADC_RegInit.DMATransfer      = LL_ADC_REG_DMA_TRANSFER_NONE;
    ADC_RegInit.Overrun          = LL_ADC_REG_OVR_DATA_OVERWRITTEN;
    LL_ADC_REG_Init(ADC1, &ADC_RegInit);

    /* Disable ADC deep power down (enabled by default after reset state) */
    LL_ADC_DisableDeepPowerDown(ADC1);

    /* Enable ADC internal voltage regulator */
    LL_ADC_EnableInternalRegulator(ADC1);

    /* Delay for ADC internal voltage regulator stabilization.                */
    /* Compute number of CPU cycles to wait for, from delay in us.            */
    /* Note: Variable divided by 2 to compensate partially                    */
    /*       CPU processing cycles (depends on compilation optimization).     */
    /* Note: If system core clock frequency is below 200kHz, wait time        */
    /*       is only a few CPU processing cycles.                             */

    cClockInfo::Delay_us(LL_ADC_DELAY_INTERNAL_REGUL_STAB_US);

    //Calibrate and Enable ADC1
    LL_ADC_StartCalibration(ADC1, LL_ADC_SINGLE_ENDED);
    while (LL_ADC_IsCalibrationOnGoing(ADC1));

    // ADC_EN wurdenur beim Debuggen gesetzt. Nicht während run
    // Mit den 10us Wartezeiten ging es dann.
    cClockInfo::Delay_us(10);

    LL_ADC_ConfigOverSamplingRatioShift(ADC1, LL_ADC_OVS_RATIO_16, LL_ADC_OVS_SHIFT_RIGHT_4);
    LL_ADC_SetOverSamplingScope(ADC1, LL_ADC_OVS_GRP_REGULAR_CONTINUED);

    LL_ADC_ClearFlag_ADRDY(ADC1);
    LL_ADC_Enable(ADC1);
    cClockInfo::Delay_us(10);

    while (!LL_ADC_IsEnabled(ADC1));
  }

  void vDeInitAdc()
  {
    LL_ADC_CommonDeInit(__LL_ADC_COMMON_INSTANCE(ADC1));
    LL_ADC_DeInit(ADC1);
    __HAL_RCC_ADC_CLK_DISABLE();
  }

  void vMain_SmAdc(MAIN_tenEvents lenEvent)
  {
    if (lenEvent == nEvReset)
    {
      menSmMain_Adc = nSmIdle;
    }
    else
    if (lenEvent == nEvStop)
    {
      vDeInitAdc();
      menSmMain_Adc = nSmIdle;
    }
    else
    {
      switch (menSmMain_Adc)
      {
        case nSmIdle:
          if (lenEvent == nEvStart)
          {
            vInitAdc();

            // To convert a single channel, program a sequence with a length of 1.
            // It is not possible to have both discontinuous mode and continuous mode enabled: it is forbidden to set both DISCEN=1 and CONT=1

            LL_ADC_REG_SetSequencerRanks(ADC1, LL_ADC_REG_RANK_1, nChnPoti);
            LL_ADC_SetChannelSamplingTime(ADC1, nChnPoti, LL_ADC_SAMPLINGTIME_12CYCLES_5);
            LL_ADC_REG_StartConversion(ADC1);
            menSmMain_Adc = nSmAdcRun;
          }
          break;

        case nSmAdcRun:
          // continous mode, nothing todo
          break;
        default:
          break;

      }
    }
  }

  u32 u32GetPoti_mv() { return (LL_ADC_REG_ReadConversionData12(ADC1) * nAdcRefmV) / nAdcResolution; }
};

class cMotControl_Base
{
  public:

  enum class cenDriveMode : u8 {nSpeed, nPos};

  // --- Pins
  cGpPin* mcPinMotA;
  cGpPin* mcPinMotB;

  // --- Timer for PW
  TIM_TypeDef* mstTim;

  i16     mi16Pwm;
  u16     mu16PwmA;
  u16     mu16PwmB;

  i16 mi16SetPos;
  i16 mi16ActualPos;
  i32 mi32ActualCurrent;

  u8  mu8Mode;

  cMotControl_Base(cGpPin* lcPinMotA, cGpPin* lcPinMotB, TIM_TypeDef *lstTim)
  {
    mcPinMotA = lcPinMotA;
    mcPinMotB = lcPinMotB;
    mstTim    = lstTim;

    vSetPwm(100, 100);

    mi16ActualPos   = 1400;
    mi16SetPos      = 1400;
    mu8Mode         = 0;
  }

  void vTick1ms()
  {
  }

  void vSetPwm(u16 lu16PwmA, u16 lu16PwmB)
  {
    if (lu16PwmA > 100) lu16PwmA = 100;
    if (lu16PwmB > 100) lu16PwmB = 100;

    mu16PwmA = lu16PwmA;
    mu16PwmB = lu16PwmB;
  }

  void vSetPwm(i16 li16Pwm)
  {
    mi16Pwm = li16Pwm;
    if (li16Pwm > 0)
    {
      vSetPwm(li16Pwm, 0);
    }
    else if (li16Pwm < 0)
    {
      vSetPwm(0, -li16Pwm);
    }
    else
    {
      vSetPwm(100, 100);
    }
  }

  i16 i16GetPosGrad()
  {
    return mi16ActualPos;
  }
};


class cMotTest : public cMotControl_Base
{
  public:

  // --- Pins
  cGpPin mcPinMotA;
  cGpPin mcPinMotB;

  // raw sensor inputs
  volatile uint16_t ADC_DMA[3] = { 0,0,0 };
  // filtered sensor inputs
  float motor_current_input_adc = 0.0f;
  float position_input_adc = 0.0f;
  float voltage_input_adc = 0.0f;
  float motor_current_input_adc_offset = 0.0f;
  float pwm_sign = 0.0f;
  float pwm_ratio = 0.0f;
  // scaled sensor inputs
  float present_motor_current_ma = 0.0f;
  float present_position_deg = 0.0f;
  float present_voltage_0v1 = 0.0f;
  // setpoints
  float setpoint_pwm = 0.0f;
  float setpoint_current_ma = 0.0f;
  float setpoint_acceleration_dpss = 0.0f;
  float setpoint_velocity_dps = 0.0f;
  float setpoint_position_deg = 0.0f;
  // control loop state
  bool entering_state = true;
  uint32_t current_control_mode = REG_CONTROL_MODE_POSITION;
  uint16_t const period_us = (uint16_t)(1000000.0f/LOOP_FREQUENCY_HZ);
  uint32_t counter = 0;

  // PIDs
  cFpPid pid_position;
  cFpPid pid_current;

  // variables
  float present_velocity_dps = 0.0f;
  float last_present_position_deg = 0.0f;
  float last_setpoint_velocity_dps = 0.0f;

  cControlTable* mcControlTable;


  cMotTest(TIM_TypeDef *lstTim, cControlTable* lcControlTable)
    : cMotControl_Base(&mcPinMotA, &mcPinMotB, lstTim),
      mcPinMotA(GPIOB_BASE, 13, GPIO_MODE_OUTPUT_PP, GPIO_NOPULL, GPIO_SPEED_FREQ_VERY_HIGH, 0),
      mcPinMotB(GPIOB_BASE, 14, GPIO_MODE_OUTPUT_PP, GPIO_NOPULL, GPIO_SPEED_FREQ_VERY_HIGH, 0)
  {
    mcPinMotA.vSetAF(GPIO_MODE_AF_PP, GPIO_AF1_TIM1);
    mcPinMotB.vSetAF(GPIO_MODE_AF_PP, GPIO_AF1_TIM1);

    vSetPwm(100,100);

    TIM_vInit();

    APP_Control_Init();

    mcControlTable = lcControlTable;
  }

  // called once after SW REBBOT or HW RESET, and every time entering a new control loop mode
  void APP_Control_Reset()
  {
    // reset
    entering_state = true;
    counter = 0;
    pid_position.pid_reset();
    pid_current.pid_reset();
    setpoint_pwm = 0.0f;
    setpoint_current_ma = 0.0f;
    setpoint_acceleration_dpss = 0.0f;
    setpoint_velocity_dps = 0.0f;
    last_setpoint_velocity_dps = 0.0f;
    setpoint_position_deg = present_position_deg;
    last_present_position_deg = present_position_deg;
    // when re-entering in the control mode 'position', avoid glitch from past goal position
    mcControlTable->regs[REG_GOAL_POSITION_DEG_L] = LOW_BYTE((int16_t)(present_position_deg*10.0f));
    mcControlTable->regs[REG_GOAL_POSITION_DEG_H] = HIGH_BYTE((int16_t)(present_position_deg*10.0f));
  }

  void scale_all_sensors()
  {
    // scale motor current sense (unit:mA) and estimated average motor current with sign (using PWM ratio and setpoint PWM sign)
    //float const a = (float)(MAKE_SHORT(mcControlTable->regs[REG_CAL_CURRENT_SENSE_A_L],mcControlTable->regs[REG_CAL_CURRENT_SENSE_A_H]));
    //present_motor_current_ma = (motor_current_input_adc-motor_current_input_adc_offset)/a*1000.0f*pwm_sign*pwm_ratio;
    present_motor_current_ma = motor_current_input_adc;

