buzzwang1/pcb/source/main/STM32L433CCT/Mot/Test03/MotCtrl.h
    // scale position (unit:degrees)
    //float const min_position_adc = (float)(MAKE_SHORT(mcControlTable->regs[REG_MIN_POSITION_ADC_L],mcControlTable->regs[REG_MIN_POSITION_ADC_H]));
    //float const max_position_adc = (float)(MAKE_SHORT(mcControlTable->regs[REG_MAX_POSITION_ADC_L],mcControlTable->regs[REG_MAX_POSITION_ADC_H]));
    //float const max_rotation_deg = (float)(mcControlTable->regs[REG_MAX_ROTATION_DEG]);

    //present_position_deg = cMathTool::fmap(position_input_adc, min_position_adc, max_position_adc, 0.0f, max_rotation_deg);
    present_position_deg = (position_input_adc /*- 2048*/) / 14.83f;


    // potentiometer leads maybe inverted, user can reverse polarity of potentiometer (EEPROM parameter)
    if (mcControlTable->regs[REG_INV_ROTATION_SENSOR] > 0)
      present_position_deg = -present_position_deg;//max_rotation_deg-present_position_deg;

    // scale voltage (unit:0.1V)
    //present_voltage_0v1 = voltage_input_adc/16384.0f*3.3f*24.2f/2.2f*10.0f*VOLTAGE_CALIBRATION;
    present_voltage_0v1 = voltage_input_adc;
  }

  // called once after SW REBOOT or HW RESET
  void APP_Control_Init()
  {
    // reset (EWMA) filtered sensor inputs
    motor_current_input_adc = 0.0f;
    position_input_adc = 0.0f; // NOTE : init by zero will delay the present position estimation by 1 ms at least
    voltage_input_adc = 0.0f; // NOTE : init by zero will delay the present voltage estimation by 1 ms at least
    motor_current_input_adc_offset = (float)(MAKE_SHORT(mcControlTable->regs[REG_CAL_CURRENT_SENSE_B_L],mcControlTable->regs[REG_CAL_CURRENT_SENSE_B_H]));

    // reset all state control loop variables
    APP_Control_Reset();
  }

  // called from main loop
  void APP_Control_Process()
  {
    // scale sensor at process rate
    scale_all_sensors();

    // compute velocity from position (derivative), and filter velocity (EWMA)
    float present_speed_dps_unfiltered = (present_position_deg - last_present_position_deg)*LOOP_FREQUENCY_HZ;
    last_present_position_deg =  present_position_deg;
    present_velocity_dps = ALPHA_VELOCITY * present_speed_dps_unfiltered + (1.0f-ALPHA_VELOCITY)*present_velocity_dps;

    // torque enable logic
    bool torque_enable = (mcControlTable->regs[REG_TORQUE_ENABLE]!=0) && (mcControlTable->regs[REG_HARDWARE_ERROR_STATUS]==0);
    if(torque_enable)
    {
      // Simple PID from position to pwm
      // Mg92 Kp = 400 Ki = 20 Kd = 400
      if(entering_state)
      {
        entering_state = false;
        // init goal RAM registers according this control mode
        mcControlTable->regs[REG_GOAL_POSITION_DEG_L] = LOW_BYTE((int16_t)(present_position_deg*10.0f));
        mcControlTable->regs[REG_GOAL_POSITION_DEG_H] = HIGH_BYTE((int16_t)(present_position_deg*10.0f));
        // init limit RAM registers according this control mode
        mcControlTable->regs[REG_GOAL_PWM_100_L] = mcControlTable->regs[REG_MAX_PWM_100_L];
        mcControlTable->regs[REG_GOAL_PWM_100_H] = mcControlTable->regs[REG_MAX_PWM_100_H];
        // reset others
        mcControlTable->regs[REG_GOAL_VELOCITY_DPS_L] = 0;
        mcControlTable->regs[REG_GOAL_VELOCITY_DPS_H] = 0;
        mcControlTable->regs[REG_GOAL_CURRENT_MA_L] = 0;
        mcControlTable->regs[REG_GOAL_CURRENT_MA_H] = 0;
        // set setpoint position at current position
        setpoint_position_deg = present_position_deg;
      }
      {
        // limit goal position
        float const min_goal_position_deg = (float)(MAKE_SHORT(mcControlTable->regs[REG_MIN_POSITION_DEG_L],mcControlTable->regs[REG_MIN_POSITION_DEG_H]));
        float const max_goal_position_deg = (float)(MAKE_SHORT(mcControlTable->regs[REG_MAX_POSITION_DEG_L],mcControlTable->regs[REG_MAX_POSITION_DEG_H]));
        float goal_position_deg           = 0.1f * (float)(MAKE_SHORT(mcControlTable->regs[REG_GOAL_POSITION_DEG_L],mcControlTable->regs[REG_GOAL_POSITION_DEG_H]));
        goal_position_deg = cMathTool::fconstrain(goal_position_deg,min_goal_position_deg,max_goal_position_deg);
        // compute position setpoint from goal position
        // there is no profil, so position setpoint is goal position
        setpoint_position_deg = goal_position_deg;
        // compute position error
        float const error_position = setpoint_position_deg - present_position_deg;
        // compute pwm setpoint from position error using a PID position
        float const pid_pos_kp = (float)(MAKE_SHORT(mcControlTable->regs[REG_PID_POSITION_KP_L], mcControlTable->regs[REG_PID_POSITION_KP_H]))/4.0f;
        float const pid_pos_ki = (float)(MAKE_SHORT(mcControlTable->regs[REG_PID_POSITION_KI_L], mcControlTable->regs[REG_PID_POSITION_KI_H]))/512.0f;
        float const pid_pos_kd = (float)(MAKE_SHORT(mcControlTable->regs[REG_PID_POSITION_KD_L], mcControlTable->regs[REG_PID_POSITION_KD_H]))/4.0f;
        float const pwm_limit  = (float)(MAKE_SHORT(mcControlTable->regs[REG_GOAL_PWM_100_L],    mcControlTable->regs[REG_GOAL_PWM_100_H]));
        setpoint_pwm = pid_position.pid_process_antiwindup_clamp(
                          error_position,
                          pid_pos_kp,
                          pid_pos_ki,
                          pid_pos_kd,
                          pwm_limit
                      );
      }
      // unused setpoints zero
      setpoint_velocity_dps = 0.0f;
      setpoint_current_ma   = 0.0f;
      // mode change
      if(mcControlTable->regs[REG_CONTROL_MODE]!=REG_CONTROL_MODE_POSITION)
      {
        APP_Control_Reset();
        current_control_mode = mcControlTable->regs[REG_CONTROL_MODE];
      }

      // motor leads maybe inverted, user can reverse polarity of motor (EEPROM parameter)
      float const pwm_inv = mcControlTable->regs[REG_INV_ROTATION_MOTOR] > 0 ? -1.0f : 1.0f;
      float pwm = pwm_inv * setpoint_pwm;

      vSetPwm((i16)pwm);
      vSetMode(3);
    }
    else
    {
      APP_Control_Reset();
      // motor brake
      //__HAL_TIM_SET_COMPARE(&htim4,TIM_CHANNEL_1,MOTOR_PWM_BRAKE);
      //__HAL_TIM_SET_COMPARE(&htim4,TIM_CHANNEL_2,MOTOR_PWM_BRAKE);
      mstTim->CCR1 = 0;
      mstTim->CCR2 = 0;
    }

    // Note : This is an unipolar current sensing architecture,
    // then motor current is always positive in FORWARD and REVERSE drive phase,
    // and zero in BRAKE phases. So, the sign of the current, is build from the sign of the PWM setpoint
    pwm_sign = ( setpoint_pwm < 0.0f ) ? -1.0f : 1.0f;
    pwm_ratio = fabsf(setpoint_pwm)/100.0f;

