buzzwang1/pcb/source/main/STM32L433CCT/Mot/Test03/MotCtrl.h
    // live update of RAM mcControlTable->regs
    mcControlTable->regs[REG_PRESENT_POSITION_DEG_L] = LOW_BYTE((uint16_t)(present_position_deg*10.0f));
    mcControlTable->regs[REG_PRESENT_POSITION_DEG_H] = HIGH_BYTE((uint16_t)(present_position_deg*10.0f));

    mcControlTable->regs[REG_PRESENT_VELOCITY_DPS_L] = LOW_BYTE((int16_t)present_velocity_dps);
    mcControlTable->regs[REG_PRESENT_VELOCITY_DPS_H] = HIGH_BYTE((int16_t)present_velocity_dps);

    mcControlTable->regs[REG_PRESENT_CURRENT_MA_L] = LOW_BYTE((int16_t)present_motor_current_ma);
    mcControlTable->regs[REG_PRESENT_CURRENT_MA_H] = HIGH_BYTE((int16_t)present_motor_current_ma);

    mcControlTable->regs[REG_PRESENT_VOLTAGE] = (uint8_t)(present_voltage_0v1);
    mcControlTable->regs[REG_PRESENT_TEMPERATURE] = 0;

    float moving_threshold = mcControlTable->regs[REG_MOVING_THRESHOLD_DPS];
    mcControlTable->regs[REG_MOVING] = ( fabsf(present_velocity_dps) > moving_threshold ) ? 1 : 0;

    mcControlTable->regs[REG_SETPOINT_POSITION_DEG_L] = LOW_BYTE((uint16_t)(setpoint_position_deg*10.0f));
    mcControlTable->regs[REG_SETPOINT_POSITION_DEG_H] = HIGH_BYTE((uint16_t)(setpoint_position_deg*10.0f));

    mcControlTable->regs[REG_SETPOINT_VELOCITY_DPS_L] = LOW_BYTE((int16_t)setpoint_velocity_dps);
    mcControlTable->regs[REG_SETPOINT_VELOCITY_DPS_H] = HIGH_BYTE((int16_t)setpoint_velocity_dps);
    //mcControlTable->regs[REG_SETPOINT_VELOCITY_DPS_L] = LOW_BYTE((int16_t)pid_position.err_integral); // DEBUG
    //mcControlTable->regs[REG_SETPOINT_VELOCITY_DPS_H] = HIGH_BYTE((int16_t)pid_position.err_integral); // DEBUG

    mcControlTable->regs[REG_SETPOINT_CURRENT_MA_L] = LOW_BYTE((int16_t)setpoint_current_ma);
    mcControlTable->regs[REG_SETPOINT_CURRENT_MA_H] = HIGH_BYTE((int16_t)setpoint_current_ma);

    mcControlTable->regs[REG_SETPOINT_PWM_100_L] = LOW_BYTE((int16_t)setpoint_pwm);
    mcControlTable->regs[REG_SETPOINT_PWM_100_H] = HIGH_BYTE((int16_t)setpoint_pwm);

    mcControlTable->regs[REG_MOTOR_CURRENT_INPUT_ADC_L] = LOW_BYTE((uint16_t)motor_current_input_adc);
    mcControlTable->regs[REG_MOTOR_CURRENT_INPUT_ADC_H] = HIGH_BYTE((uint16_t)motor_current_input_adc);

    mcControlTable->regs[REG_MOTOR_CURRENT_INPUT_ADC_OFFSET_L] = LOW_BYTE((uint16_t)motor_current_input_adc_offset);
    mcControlTable->regs[REG_MOTOR_CURRENT_INPUT_ADC_OFFSET_H] = HIGH_BYTE((uint16_t)motor_current_input_adc_offset);

    mcControlTable->regs[REG_POSITION_INPUT_ADC_L] = LOW_BYTE((uint16_t)position_input_adc);
    mcControlTable->regs[REG_POSITION_INPUT_ADC_H] = HIGH_BYTE((uint16_t)position_input_adc);

    mcControlTable->regs[REG_VOLTAGE_INPUT_ADC_L] = LOW_BYTE((uint16_t)voltage_input_adc);
    mcControlTable->regs[REG_VOLTAGE_INPUT_ADC_H] = HIGH_BYTE((uint16_t)voltage_input_adc);

    // steps
    ++counter;
  }


  void HAL_ADC_ConvCpltCallback(i32 li32Pos, i32 li32Voltage, i32 li32Current)
  {
    //if(hadc==&hadc1)
    {
      // Filter (EWMA) position and voltage ADC samples
      //voltage_input_adc = ALPHA_VOLTAGE * (float)(ADC_DMA[2]) + (1.0f-ALPHA_VOLTAGE) * voltage_input_adc;
      //position_input_adc = ALPHA_POSITION * (float)(ADC_DMA[1]) + (1.0f-ALPHA_POSITION) * position_input_adc;
      voltage_input_adc  = 0.2f * (float)(li32Voltage) + (1.0f-0.2f) * voltage_input_adc;
      position_input_adc = 0.2f * (float)(li32Pos)     + (1.0f-0.2f) * position_input_adc;

      // Filter (EWMA) motor current sense ADC samples

      // Note : In center aligned mode, two periods of TIM4 are used for motor PWM generation
      // TIM4 is 40KHz, motor PWM is 20KHz
      // So ADC is triggered twice per motor PWM period by TIM4
      // We will measure ON and OFF instant motor current

      // In FORWARD or REVERSE DRIVE phases, PWM is ON, counter decreases
      /*
      if(__HAL_TIM_IS_TIM_COUNTING_DOWN(&htim4))
      {
        // filter motor current
        motor_current_input_adc = ALPHA_CURRENT_SENSE*(float)(ADC_DMA[0]) + (1.0f-ALPHA_CURRENT_SENSE)*motor_current_input_adc;
      }
      // In BRAKE phase, PWM is OFF, counter increases
      else
      {
        // self-calibrate ADC offset (b) when motor is stopped
        if(setpoint_pwm==0.0f)
        {
          motor_current_input_adc_offset = ALPHA_CURRENT_SENSE_OFFSET*(float)(ADC_DMA[0]) + (1.0f-ALPHA_CURRENT_SENSE_OFFSET)*motor_current_input_adc_offset;
        }
      }
      */
      motor_current_input_adc = 0.2f*(float)(li32Current) + (1.0f-0.2f)*motor_current_input_adc;

    }
  }

  void vPID()
  {
    //vSetPwm((i16)(mfy));
    //vSetMode(3);
  }

  void TIM_vInit(void)
  {
    __HAL_RCC_TIM1_CLK_ENABLE();

    TIM_HandleTypeDef TimHandle = {};

    /* Set TIM1 instance */
    TimHandle.Instance = mstTim;

    /* Initialize TIM2 peripheral as follows:
         + Period = 10000 - 1
         + Prescaler = (SystemCoreClock/1000000) - 1
         + ClockDivision = 0
         + Counter direction = Up
    */
    TimHandle.Init.Prescaler         = (cClockInfo::mstClocks.HCLK_Frequency / 2000000) -1; // 0,5 us = 2Mhz
    TimHandle.Init.Period            = 100 - 1; // 2Mhz/100 = 20khz
    //TimHandle.Init.ClockDivision     = 0;
    TimHandle.Init.CounterMode       = TIM_COUNTERMODE_UP;
    //TimHandle.Init.RepetitionCounter = 0;

    HAL_TIM_Base_Init(&TimHandle);

    TIM_OC_InitTypeDef sConfigOC = {};
    HAL_TIM_PWM_Init(&TimHandle);

    sConfigOC.OCMode       = TIM_OCMODE_PWM1;
    sConfigOC.Pulse        = 0;
    sConfigOC.OCPolarity   = TIM_OCPOLARITY_HIGH;
    sConfigOC.OCNPolarity  = TIM_OCNPOLARITY_HIGH;
    sConfigOC.OCFastMode   = TIM_OCFAST_DISABLE;
    sConfigOC.OCIdleState  = TIM_OCIDLESTATE_RESET;
    sConfigOC.OCNIdleState = TIM_OCNIDLESTATE_RESET;
    HAL_TIM_OC_ConfigChannel(&TimHandle, &sConfigOC, TIM_CHANNEL_1);
    HAL_TIM_OC_ConfigChannel(&TimHandle, &sConfigOC, TIM_CHANNEL_2);

    /*##-2- Start the TIM Base generation in interrupt mode ####################*/
    HAL_TIM_Base_Start(&TimHandle);

    // Complementary
    HAL_TIMEx_PWMN_Start(&TimHandle, TIM_CHANNEL_1);
    HAL_TIMEx_PWMN_Start(&TimHandle, TIM_CHANNEL_2);

    // Normal
    //HAL_TIM_PWM_Start(&TimHandle, TIM_CHANNEL_1);
    //HAL_TIM_PWM_Start(&TimHandle, TIM_CHANNEL_2);
  }

  void vSetMode(u8 lu8Mode)
  {
    mu8Mode = lu8Mode;

    switch (lu8Mode)
    {
      case 0: mstTim->CCR1 = 0;        mstTim->CCR2 = 0; break;
      case 1: mstTim->CCR1 = 0;        mstTim->CCR2 = mu16PwmB; break;
      case 2: mstTim->CCR1 = mu16PwmA; mstTim->CCR2 = 0; break;
      case 3: mstTim->CCR1 = mu16PwmA; mstTim->CCR2 = mu16PwmB; break;
    }
  }

  void vSetActualCurrent(i32 li32Current)
  {
     mi32ActualCurrent = li32Current;
  }

  void vSetActualPos(i16 li16Pos)
  {
     mi16ActualPos = li16Pos;
  }

  void vSetPosRel(i16 li16Pos)
  {
     mi16SetPos = li16Pos;
  }

  void vTick1ms()
  {
    APP_Control_Process();
  }

};


#endif  //__MOTOR_CONTROL_H__
